<?php
// ΟΡΙΣΜΟΣ ΣΤΟΙΧΕΙΩΝ ΣΥΝΔΕΣΗΣ
$host   = "127.0.0.1";       // Η διεύθυνση του server (το δικό μας PC στο XAMPP)
$user   = "root";            // Ο "υπερχρήστης" της βάσης (προεπιλογή XAMPP)
$pass   = "";                // Ο κωδικός (κενός στο XAMPP για ευκολία στην ανάπτυξη)
$dbname = "recipes_db";  // Το όνομα της βάσης που δημιουργήσαμε στο phpMyAdmin

// Η ΣΥΝΑΡΤΗΣΗ ΣΥΝΔΕΣΗΣ (mysqli_connect)
$conn = new mysqli("127.0.0.1", "root", "", "recipes_db");

// ΕΛΕΓΧΟΣ ΣΦΑΛΜΑΤΟΣ
// Αν η $conn είναι "false" (η σύνδεση απέτυχε)...
if (!$conn) {
    // Σταματάμε αμέσως και τυπώνουμε το σφάλμα για να ξέρουμε τι φταίει.
    die("Πρόβλημα Σύνδεσης: " . mysqli_connect_error());
}


mysqli_set_charset($conn, "utf8mb4");


?>
